---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
source: html/37262abc-7f1d-3cab-da96-6cf631c0217f.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange

Defines parameters for I-shape Sloped Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionISlopedFlange : StructuralSectionGeneralI
```